# 6. Реализовать два небольших скрипта:
# итератор, генерирующий целые числа, начиная с указанного;
# итератор, повторяющий элементы некоторого списка, определённого заранее.
# Подсказка: используйте функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Предусмотрите условие его завершения. Например, в первом задании
# выводим целые числа, начиная с 3. При достижении числа 10 — завершаем цикл.
# Вторым пунктом необходимо предусмотреть условие, при котором повторение
# элементов списка прекратится.

from itertools import cycle, count

start = int(input('Стартовое число: '))
stop = start * 2 + 10 + 1

for i in count(start):
    if i < stop:
        print(i)
    else:
        break
del i

my_list = [i for i in range(stop)]
count = 0
for b in cycle(my_list):
    if count < stop + 10:
        print(b)
        count += 1
    else:
        break
